# SQL

# Assignment1

1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias
name as &lt;WORKER_NAME&gt;.
2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.
3. Write an SQL query to show the last 5 record from a table.

In [1]:
"""
select first_name as worker_name from worker

"""

'\nselect first_name as worker_name from worker\n\n'

In [2]:
"""
select distinct(department) as departent from worker



"""

'\nselect distinct(department) as departent from worker\n\n\n\n'

In [3]:
"""

-- lets say we have  a primary key as id then
(select * worker order by id desc limit 5) order by id asc 



"""

'\n\n-- lets say we have  a primary key as id then\n(select * worker order by id desc limit 5) order by id asc \n\n\n\n'

# assignment 2

1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker
table.
2. Write an SQL query to find the position of the alphabet (‘a’) in the first name
column ‘Amitabh’ from Worker table.
3. Write an SQL query to print the name of employees having the highest salary in each
department.

In [4]:
"""
select substring(first_name,1,3) as first_three from worker



"""

'\nselect substring(first_name,1,3) as first_three from worker\n\n\n\n'

In [5]:
"""
select charindex('a', first_name)



"""

"\nselect charindex('a', first_name)\n\n\n\n"

In [6]:
'''
select first_name,max(salary),deparment from worker group by department






'''

'\nselect first_name,max(salary),deparment from worker group by department\n\n\n\n\n\n\n'

# assignment 3

1. Write an SQL query to print the FIRST_NAME from Worker table after removing
white spaces from the right side.
2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker
table and prints its length.
3. Write an SQL query to fetch nth max salaries from a table.

In [9]:
"""

select rtrim(first_name) from worker




"""

'\n\nselect rtrim(first_name) from worker\n\n\n\n\n'

In [10]:

"""


select distinct(department) as department ,len(department) from worker"""

'\n\n\nselect distinct(department) as department ,len(department) from worker'

In [11]:

"""


select salary deom worker order by salary desc limit n


"""

'\n\n\nselect salary deom worker order by salary desc limit n\n\n\n'

 # asignment 4

1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’
with ‘A’.
2. Write an SQL query to print all Worker details from the Worker table order by
FIRST_NAME Ascending and DEPARTMENT Descending.
3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [13]:
"""
select replace(first_name, 'a','A') as first from worker


"""

"\nselect replace(first_name, 'a','A') as first from worker\n\n\n"

In [14]:
"""
select * from worker order by first_name asc, department desc


"""

'\nselect * from worker order by first_name asc, department desc\n\n\n'

In [15]:
"""
select first_name deom worker order by salary desc limit 20




"""

'\nselect first_name deom worker order by salary desc limit 20\n\n\n\n\n'

# assignment 6

1. Write an SQL query to print details of the Workers who have joined in Feb’2014.
2. Write an SQL query to fetch duplicate records having matching data in some fields of
a table.
3. How to remove duplicate rows from Employees table.

In [16]:
"""
select * from worker where joining_date between 2014:02:01 00:00:00 and 2014:02:28 11:59:59


"""

'\nselect * from worker where joining_date between 2014:02:01 00:00:00 and 2014:02:28 11:59:59\n\n\n'

In [17]:
"""
select count(*) as dup,* from worker group by * where dup >1



"""

'\nselect count(*) as dup,* from worker group by * where dup >1\n\n\n\n'

In [18]:
'''
select * from (select count(*) as dup,* from worker group by * having dup >1)


'''

'\nselect * from (select count(*) as dup,* from worker group by * having dup >1)\n\n\n'

# assignment 7

13. Write an SQL query to show only odd rows from a table.
14. Write an SQL query to clone a new table from another table.

In [19]:

"""
select * from (select *,rownumber as rn from <table> where rn%2!=0)


"""

'\nselect * from (select *,rownumber as rn from <table> where rn%2!=0)\n\n\n'

In [20]:
"""
CREATE TABLE new_table LIKE original_table;
insert into new_table select * from original_table



"""

'\nCREATE TABLE new_table LIKE original_table;\ninsert into new_table select * from original_table\n\n\n\n'

# assignment 8

15. Write an SQL query to fetch intersecting records of two tables.
16. Write an SQL query to show records from one table that another table does not
have.

In [21]:
"""
select a.*,b.* from table_1 as a inner join table_2 as b on a.primry_key=b.primary_key

"""

'\nselect a.*,b.* from table_1 as a inner join table_2 as b on a.primry_key=b.primary_key\n\n'

In [22]:
"""
select a.* from table_1 as a anti left join table_2 as b on a.primry_key=b.primary_key

"""

'\nselect a.* from table_1 as a anti left join table_2 as b on a.primry_key=b.primary_key\n\n'

# assignment 9

17. Write an SQL query to show the top n (say 10) records of a table.
18. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [25]:
"""
select top 10 from table_1

"""

'\nselect top 10 from table_1\n\n'

In [26]:
'(select * from (select * from worker order by salary desc ) limit n) order by salary asc limit 1'

'(select * from (select * from worker order by salary desc ) limit n) order by salary asc limit 1'

# asignment 10

19. Write an SQL query to determine the 5th highest salary without using TOP or limit
method.
20. Write an SQL query to fetch the list of employees with the same salary.

In [27]:
"""


      select row_number() as rn,* from (select * from worker order by salary desc) where rn=5



"""

'\n\n\n      select row_number() as rn,* from (select * from worker order by salary desc) where rn=5\n\n\n\n'

In [ ]:
"""
SELECT STRING_AGG( ISNULL(first_name, ' '), ',') As names 
       From worker group by salary



"""